/******************************************************************************
*
* Copyright 2013 Altera Corporation. All Rights Reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright notice,
* this list of conditions and the following disclaimer.
*
* 2. Redistributions in binary form must reproduce the above copyright notice,
* this list of conditions and the following disclaimer in the documentation
* and/or other materials provided with the distribution.
*
* 3. The name of the author may not be used to endorse or promote products
* derived from this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER "AS IS" AND ANY EXPRESS OR
* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
* MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, ARE DISCLAIMED. IN NO
* EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
* EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
* OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING

 *      + Data read timeout/boot data start
 *      + Response Timeout/Boot ack received
 *      + Data CRC error
 *      + Response CRC error
 *      + Receive FIFO data request
 *      + Transmit FIFO data request
 *      + Data transfer over
 *      + Command done
 *      + Response error
 *    - sdmmc_sberr, single bit ECC error
 *    - sdmmc_dberr, double bit ECC error
 *
 * References:
 *  * Altera, Cyclone V Device Handbook Volume 3: Hard Processor System
 *    Technical Reference Manual, SD/MMC Controller.
 *  * Synopsys, DesignWare Cores Mobile Storage Host Databook, DWC_mobile_storage
 *
 * Notes:
 *  * To avoid glitches in the card clock outputs (cclk_out), the software should
 *    use the steps outlined in section 7.4 Phase Switching of the databook when
 *    changing the card clock frequency.
 *    
 *  * In order to utilize ECC, follow the embedded RAM initialization procedure in
 *    section 8 Enabling ECC of the data book.
 *
 *  * The SD/MMC controller does not directly support voltage switching, card
 *    interrupts, or back-end power control of eSDIO card devices. However, you can
 *    connect these signals to general-purpose I/Os (GPIOs).
 *
 *  * The SD/MMC controller does not contain a reset output as part of the external
 *    card interface. To reset the flash card device, consider using a general
 *    purpose output pin.
 *
 * Features:
 *  * Block Read/Write support
 *    - Internal DMA used for efficiency
 *  * Command Engine Interface 
 *  * Internal DMA Interface
 *  * Configuration and Status Interface
 *  * Interrupt Status and Control Interface
 * @{
 */

/******************************************************************************/
/*! \addtogroup ALT_SDMMC_CSR General Control and Status Functions
 *
 * The declarations and functions in this group provide general purpose control
 * and status functions for the SD/MMC Controller.
 * @{
 */

/*!
 * This type enumerates the possible card/device type that may be connected to the
 * SD/MMC controller.
 */
typedef enum ALT_SDMMC_CARD_TYPE_e
{
    ALT_SDMMC_CARD_TYPE_NOTDETECT  = 0, /*!< Cart type has not identified yet */
    ALT_SDMMC_CARD_TYPE_MMC        = 1, /*!< MultiMedia Card */
    ALT_SDMMC_CARD_TYPE_SD         = 2, /*!< Secure Digital Memory Card */
    ALT_SDMMC_CARD_TYPE_SDIOIO     = 3, /*!< Secure Digital Input Output */
    ALT_SDMMC_CARD_TYPE_SDIOCOMBO  = 4, /*!< Secure Digital Input Output Combo */
    ALT_SDMMC_CARD_TYPE_SDHC       = 5, /*!< Secure Digital High Capacity */
    ALT_SDMMC_CARD_TYPE_CEATA      = 6, /*!< Serial ATA interface based on the 
                                         *   MultiMediaCard standard
                                         */
} ALT_SDMMC_CARD_TYPE_t;

/*!
 * This type defines a structure to hold identification and type information for a
 * card connected to the SD/MMC controller.
 *
 * \internal
 * See: Card_info declaration in synopmob_bus.h
 * \endinternal
 */
typedef struct ALT_SDMMC_CARD_INFO_s
{
    ALT_SDMMC_CARD_TYPE_t   card_type;          /*!< Type of the card */
    uint32_t                rca;                /*!< Releative Card Address (RCA) */
    uint32_t                xfer_speed;         /*!< The maximum data transfer rate (bit/s) */
    uint32_t                max_r_blkln;        /*!< Max read data block length */
    uint32_t                max_w_blkln;        /*!< Max write data block length */
    bool                    partial_r_allowed;  /*!< Partial blocks for read allowed */
    bool                    partial_w_allowed;  /*!< Partial blocks for write allowed */
} ALT_SDMMC_CARD_INFO_t;

/*!
 * Initialize the SD/MMC controller.
 * 
 * Initializes the SD/MMC controller by gracefully bringing the controller out of
 * reset. This function also initializes the registers, FIFO buffer pointers, DMA
 * interface controls, and state machines in the controller. All interrupts are
 * cleared and disabled (masked) and timeout parameters set to default values.
 *
 * \retval      ALT_E_SUCCESS   The operation was successful.
 * \retval      ALT_E_ERROR     The operation failed.
 */
ALT_STATUS_CODE alt_sdmmc_init(void);

/*!
 * Uninitializes the SD/MMC controller by stopping any data transfers in progress and
 * putting the controller into reset.
 *
 * \retval      ALT_E_SUCCESS   The operation was successful.
 * \retval      ALT_E_ERROR     The operation failed.
 */
ALT_STATUS_CODE alt_sdmmc_uninit(void);

/*!
 * Reset the SD/MMC controller by stopping any data transfers in progress and
 * putting the controller into reset and reinit it after reset complete.
 *
 * \retval      ALT_E_SUCCESS   The operation was successful.
 * \retval      ALT_E_ERROR     The operation failed.
 */
ALT_STATUS_CODE alt_sdmmc_reset(void);

/*!
 * This type enumerates the SDMMC evailable commands. Read specification 
 * to the appropriate card type
 */
typedef enum ALT_SDMMC_CMD_INDEX_e
{
    /* TBD - Standart sdmmc commands... */
    ALT_SDMMC_GO_IDLE_STATE          = 0,
    ALT_SDMMC_ALL_SEND_CID           = 2,
    ALT_SDMMC_SET_RELATIVE_ADDR      = 3,
    ALT_SDMMC_SET_DSR                = 4,
    ALT_SDMMC_SEND_OP_COND           = 5,
    ALT_SDMMC_SWITCH                 = 6,
    ALT_SDMMC_SEL_DES_CARD           = 7,
    ALT_SDMMC_IF_COND                = 8,
    ALT_SDMMC_SEND_EXT_CSD           = 8,
    ALT_SDMMC_SEND_CSD               = 9,
    ALT_SDMMC_SEND_CID               = 10,
    ALT_SDMMC_READ_DAT_UNTIL_STOP    = 11,
    ALT_SDMMC_STOP_TRANSMISSION      = 12,
    ALT_SDMMC_SEND_STATUS            = 13,
    ALT_SDMMC_GO_INACTIVE_STATE      = 15,
    ALT_SDMMC_SET_BLOCKLEN           = 16,
    ALT_SDMMC_READ_SINGLE_BLOCK      = 17,
    ALT_SDMMC_READ_MULTIPLE_BLOCK    = 18,
    ALT_SDMMC_WRITE_DAT_UNTIL_STOP   = 20,
    ALT_SDMMC_WRITE_BLOCK            = 24,
    ALT_SDMMC_WRITE_MULTIPLE_BLOCK   = 25,
    ALT_SDMMC_PROGRAM_CID            = 26,
    ALT_SDMMC_PROGRAM_CSD            = 27,
    ALT_SDMMC_SET_WRITE_PROT         = 28,
    ALT_SDMMC_CLR_WRITE_PROT         = 29,
    ALT_SDMMC_SEND_WRITE_PROT        = 30,
    ALT_SDMMC_TAG_SECTOR_START       = 32,
    ALT_SDMMC_TAG_SECTOR_END         = 33,
    ALT_SDMMC_UNTAG_SECTOR           = 34,
    ALT_SDMMC_TAG_ERASE_GROUP_START  = 35,
    ALT_SDMMC_TAG_ERASE_GROUP_END    = 36,
    ALT_SDMMC_UNTAG_ERASE_GROUP      = 37,
    ALT_SDMMC_ERASE                  = 38,
    ALT_SDMMC_FAST_IO                = 39,
    ALT_SDMMC_GO_IRQ_STATE           = 40,
    ALT_SDMMC_LOCK_UNLOCK            = 42,
    ALT_SDMMC_APP_CMD                = 55,
    ALT_SDMMC_GEN_CMD                = 56,
    ALT_SDMMC_READ_OCR               = 58,
    ALT_SDMMC_CRC_ON_OFF             = 59,
    
    ALT_SDMMC_STANDART_CMD_ALL       = 60,
    
    /* TBD - Commands specific for card type. */
    ALT_SD_SET_BUS_WIDTH             = 6,
    ALT_SD_SEND_OP_COND              = 41,
    ALT_SD_SEND_SCR                  = 51,

    /* TBD - Clock command or command index does not matter... */
    ALT_SDMMC_CLK_INDEX              = -1,

    ALT_SDMMC_CMD_ALL                = ALT_SDMMC_STANDART_CMD_ALL + 1
} ALT_SDMMC_CMD_INDEX_t;

/*!
 * This type defines a structure for command with options.
 */
typedef struct ALT_SDMMC_CMD_CONFIG_s 
{
    uint32_t    cmd_index                       : 6; //0-5
                                /*!< Command index */
    uint32_t    response_expect                 : 1; //6
                                /*!< Response expected from card */
    uint32_t    response_length_long            : 1; //7
                                /*!< Long response expected from card */
    uint32_t    check_response_crc              : 1; //8
                                /*!< Check response CRC */
    uint32_t    data_expected                   : 1; //9
                                /*!< Data transfer expected (read/write) */
    uint32_t    write_active                    : 1; //10
                                /*!< 0 – Read from card 
                                 *   1 – Write to card 
                                 */
    uint32_t    stream_mode_active              : 1; //11
                                /*!< Stream data transfer command */
    uint32_t    send_auto_stop                  : 1; //12
                                /*!< Send stop command at end of data transfer */
    uint32_t    wait_prvdata_complete           : 1; //13
                                /*!< Wait for previous data transfer completion
                                 *   before sending command 
                                 */
    uint32_t    stop_abort_cmd                  : 1; //14
                                /*!< Stop or abort command intended to stop
                                 *   current data transfer in progress.
                                 */
    uint32_t    send_initialization             : 1; //15
                                /*!< Send initialization sequence before 
                                 *   sending this command
                                 */
    uint32_t    card_number                     : 5; //16-20
                                /*!< Card number in use. Represents physical
                                 *   slot number of card being accessed.
                                 */
    uint32_t    update_clock_registers_only     : 1; //21
                                /*!< Do not send commands, just update clock
                                 *   register value into card clock domain
                                 */
    uint32_t    read_ceata_device               : 1; //22
                                /*!< Host is performing read access (RW_REG or RW_BLK)
                                 *   towards CE-ATA device 
                                 */
    uint32_t    ccs_expected                    : 1; //23
                                /*!< Interrupts are enabled in CE-ATA device (nIEN = 0),
                                 *   and RW_BLK command expects command completion
                                 *   signal from CE-ATA device 
                                 */
    uint32_t    enable_boot                     : 1; //24
                                /*!< Enable Boot—this bit should be set only for
                                 *   mandatory boot mode.
                                 */
    uint32_t    expect_boot_ack                 : 1; //25
                                /*!< Expect Boot Acknowledge. When Software sets
                                 *   this bit along with enable_boot, CIU expects a boot
                                 *   acknowledge start pattern of 0-1-0 from the selected card 
                                 */
    uint32_t    disable_boot                    : 1; //26
                                /*!< Disable Boot. */
    uint32_t    boot_mode                       : 1; //27
                                /*!< Boot Mode 
                                 *   0 - Mandatory Boot operation
                                 *   1 - Alternate Boot operation
                                 */
    uint32_t    volt_switch                     : 1; //28
                                /*!< Voltage switching enabled; must be set for CMD11 only */
    uint32_t    use_hold_reg                    : 1; //29
                                /*!< CMD and DATA sent to card through the HOLD Register */
    uint32_t    reserved                        : 1; //30
    uint32_t    start_bit                       : 1; //31
                                /*!< Start command. Once command is taken by CIU, 
                                 *   bit is cleared. When bit is set, host should 
                                 *   not attempt to write to any command registers. 
                                 *   If write is attempted, hardware lock error 
                                 *   is set in raw interrupt register.
                                 */
} ALT_SDMMC_CMD_CONFIG_t;

/*!
 * Send the a command and command argument to the card and optionally return the
 * command response.
 *
 * \param       command
 *              The card command.
 *
 * \param       command_arg
 *              The card command argument.
 *
 * \param       response
 *              [out] A pointer to a 4 (32-bit) word to return the card command
 *              response. If NULL is passed then any card command response is
 *              ignored.
